Svndsn/pan_tilt/embedded/controller/tm4c123/startup_gcc.c

#include "tm4c123gh6pm.h"
#include <stdint.h>


//*****************************************************************************
//
// Forward declaration of the default fault handlers.
//
//*****************************************************************************
void ResetISR(void);
static void NmiSR(void);
static void FaultISR(void);
static void IntDefaultHandler(void);

//*****************************************************************************
//
// External declarations for the interrupt handlers used by the application.
//
//*****************************************************************************
extern void xPortPendSVHandler(void);
extern void vPortSVCHandler(void);
extern void xPortSysTickHandler(void);
extern void UART0_Handler(void);

//*****************************************************************************
//
// The entry point for the application.
//
//*****************************************************************************
extern int main(void);

//*****************************************************************************
//
// Reserve space for the system stack.
//
//*****************************************************************************
static uint32_t pui32Stack[128];

//*****************************************************************************
//
// The vector table.  Note that the proper constructs must be placed on this to
// ensure that it ends up at physical address 0x0000.0000.
//
//*****************************************************************************
__attribute__((section(".isr_vector"))) void (*const g_pfnVectors[])(void) = {
    (void (*)(void))((uint32_t)pui32Stack + sizeof(pui32Stack)),
    // The initial stack pointer
    ResetISR,            // The reset handler
    NmiSR,               // The NMI handler
    FaultISR,            // The hard fault handler
    IntDefaultHandler,   // The MPU fault handler
    IntDefaultHandler,   // The bus fault handler
    IntDefaultHandler,   // The usage fault handler
    0,                   // Reserved
    0,                   // Reserved
    0,                   // Reserved
    0,                   // Reserved
    vPortSVCHandler,     // SVCall handler
    IntDefaultHandler,   // Debug monitor handler
    0,                   // Reserved
    xPortPendSVHandler,  // The PendSV handler
    xPortSysTickHandler, // The SysTick handler
    IntDefaultHandler,   // GPIO Port A
    IntDefaultHandler,   // GPIO Port B
    IntDefaultHandler,   // GPIO Port C
    IntDefaultHandler,   // GPIO Port D
    IntDefaultHandler,   // GPIO Port E
    UART0_Handler,       // UART0 Rx and Tx
    IntDefaultHandler,   // UART1 Rx and Tx
    IntDefaultHandler,   // SSI0 Rx and Tx
    IntDefaultHandler,   // I2C0 Master and Slave
    IntDefaultHandler,   // PWM Fault
    IntDefaultHandler,   // PWM Generator 0
    IntDefaultHandler,   // PWM Generator 1
    IntDefaultHandler,   // PWM Generator 2
    IntDefaultHandler,   // Quadrature Encoder 0
    IntDefaultHandler,   // ADC Sequence 0
    IntDefaultHandler,   // ADC Sequence 1
    IntDefaultHandler,   // ADC Sequence 2
    IntDefaultHandler,   // ADC Sequence 3
    IntDefaultHandler,   // Watchdog timer
    IntDefaultHandler,   // Timer 0 subtimer A
    IntDefaultHandler,   // Timer 0 subtimer B
    IntDefaultHandler,   // Timer 1 subtimer A
    IntDefaultHandler,   // Timer 1 subtimer B
    IntDefaultHandler,   // Timer 2 subtimer A
    IntDefaultHandler,   // Timer 2 subtimer B
    IntDefaultHandler,   // Analog Comparator 0
    IntDefaultHandler,   // Analog Comparator 1
    IntDefaultHandler,   // Analog Comparator 2
    IntDefaultHandler,   // System Control (PLL, OSC, BO)
    IntDefaultHandler,   // FLASH Control
    IntDefaultHandler,   // GPIO Port F
    IntDefaultHandler,   // GPIO Port G
    IntDefaultHandler,   // GPIO Port H
    IntDefaultHandler,   // UART2 Rx and Tx
    IntDefaultHandler,   // SSI1 Rx and Tx
    IntDefaultHandler,   // Timer 3 subtimer A
    IntDefaultHandler,   // Timer 3 subtimer B
    IntDefaultHandler,   // I2C1 Master and Slave
    IntDefaultHandler,   // Quadrature Encoder 1
    IntDefaultHandler,   // CAN0
    IntDefaultHandler,   // CAN1
    0,                   // Reserved
    0,                   // Reserved
    IntDefaultHandler,   // Hibernate
    IntDefaultHandler,   // USB0
    IntDefaultHandler,   // PWM Generator 3
    IntDefaultHandler,   // uDMA Software Transfer
    IntDefaultHandler,   // uDMA Error
    IntDefaultHandler,   // ADC1 Sequence 0
    IntDefaultHandler,   // ADC1 Sequence 1
    IntDefaultHandler,   // ADC1 Sequence 2
    IntDefaultHandler,   // ADC1 Sequence 3
    0,                   // Reserved
    0,                   // Reserved
    IntDefaultHandler,   // GPIO Port J
    IntDefaultHandler,   // GPIO Port K
    IntDefaultHandler,   // GPIO Port L
    IntDefaultHandler,   // SSI2 Rx and Tx
    IntDefaultHandler,   // SSI3 Rx and Tx
    IntDefaultHandler,   // UART3 Rx and Tx
    IntDefaultHandler,   // UART4 Rx and Tx
    IntDefaultHandler,   // UART5 Rx and Tx
    IntDefaultHandler,   // UART6 Rx and Tx
    IntDefaultHandler,   // UART7 Rx and Tx
    0,                   // Reserved
    0,                   // Reserved
    0,                   // Reserved
    0,                   // Reserved
    IntDefaultHandler,   // I2C2 Master and Slave
    IntDefaultHandler,   // I2C3 Master and Slave
    IntDefaultHandler,   // Timer 4 subtimer A
    IntDefaultHandler,   // Timer 4 subtimer B
    0,                   // Reserved
    0,                   // Reserved
    0,                   // Reserved
    0,                   // Reserved
    0,                   // Reserved
    0,                   // Reserved
    0,                   // Reserved
    0,                   // Reserved
    0,                   // Reserved
    0,                   // Reserved
    0,                   // Reserved
    0,                   // Reserved
    0,                   // Reserved
    0,                   // Reserved
    0,                   // Reserved
    0,                   // Reserved
    0,                   // Reserved
    0,                   // Reserved
    0,                   // Reserved
    0,                   // Reserved
    IntDefaultHandler,   // Timer 5 subtimer A
    IntDefaultHandler,   // Timer 5 subtimer B
    IntDefaultHandler,   // Wide Timer 0 subtimer A
    IntDefaultHandler,   // Wide Timer 0 subtimer B
    IntDefaultHandler,   // Wide Timer 1 subtimer A
    IntDefaultHandler,   // Wide Timer 1 subtimer B
    IntDefaultHandler,   // Wide Timer 2 subtimer A
    IntDefaultHandler,   // Wide Timer 2 subtimer B
    IntDefaultHandler,   // Wide Timer 3 subtimer A
    IntDefaultHandler,   // Wide Timer 3 subtimer B
    IntDefaultHandler,   // Wide Timer 4 subtimer A
    IntDefaultHandler,   // Wide Timer 4 subtimer B
    IntDefaultHandler,   // Wide Timer 5 subtimer A
    IntDefaultHandler,   // Wide Timer 5 subtimer B
    IntDefaultHandler,   // FPU
    0,                   // Reserved
    0,                   // Reserved
    IntDefaultHandler,   // I2C4 Master and Slave
    IntDefaultHandler,   // I2C5 Master and Slave
    IntDefaultHandler,   // GPIO Port M
    IntDefaultHandler,   // GPIO Port N
    IntDefaultHandler,   // Quadrature Encoder 2
    0,                   // Reserved
    0,                   // Reserved
    IntDefaultHandler,   // GPIO Port P (Summary or P0)
    IntDefaultHandler,   // GPIO Port P1
    IntDefaultHandler,   // GPIO Port P2
    IntDefaultHandler,   // GPIO Port P3
    IntDefaultHandler,   // GPIO Port P4
    IntDefaultHandler,   // GPIO Port P5
    IntDefaultHandler,   // GPIO Port P6
    IntDefaultHandler,   // GPIO Port P7
    IntDefaultHandler,   // GPIO Port Q (Summary or Q0)
    IntDefaultHandler,   // GPIO Port Q1
    IntDefaultHandler,   // GPIO Port Q2
    IntDefaultHandler,   // GPIO Port Q3
    IntDefaultHandler,   // GPIO Port Q4
    IntDefaultHandler,   // GPIO Port Q5
    IntDefaultHandler,   // GPIO Port Q6
    IntDefaultHandler,   // GPIO Port Q7
    IntDefaultHandler,   // GPIO Port R
    IntDefaultHandler,   // GPIO Port S
    IntDefaultHandler,   // PWM 1 Generator 0
    IntDefaultHandler,   // PWM 1 Generator 1
    IntDefaultHandler,   // PWM 1 Generator 2
    IntDefaultHandler,   // PWM 1 Generator 3
    IntDefaultHandler    // PWM 1 Fault
};

//*****************************************************************************
//
// The following are constructs created by the linker, indicating where the
// the "data" and "bss" segments reside in memory.  The initializers for the
// for the "data" segment resides immediately following the "text" segment.
//
//*****************************************************************************
extern uint32_t _etext;
extern uint32_t _data;
extern uint32_t _edata;
extern uint32_t _bss;
extern uint32_t _ebss;

//*****************************************************************************
//
// This is the code that gets called when the processor first starts execution
// following a reset event.  Only the absolutely necessary set is performed,
// after which the application supplied entry() routine is called.  Any fancy
// actions (such as making decisions based on the reset cause register, and
// resetting the bits in that register) are left solely in the hands of the
// application.
//
//*****************************************************************************
void ResetISR(void) {
  uint32_t *pui32Src, *pui32Dest;

  //
  // Copy the data segment initializers from flash to SRAM.
  //
  pui32Src = &_etext;
  for (pui32Dest = &_data; pui32Dest < &_edata;) {
    *pui32Dest++ = *pui32Src++;
  }

  //
  // Zero fill the bss segment.
  //
  __asm("    ldr     r0, =_bss\n"
        "    ldr     r1, =_ebss\n"
        "    mov     r2, #0\n"
        "    .thumb_func\n"
        "zero_loop:\n"
        "        cmp     r0, r1\n"
        "        it      lt\n"
        "        strlt   r2, [r0], #4\n"
        "        blt     zero_loop");

  //
  // Enable the floating-point unit.
  //
  NVIC_CPAC_R = ((NVIC_CPAC_R & ~(NVIC_CPAC_CP10_M | NVIC_CPAC_CP11_M)) |
                 NVIC_CPAC_CP10_FULL | NVIC_CPAC_CP11_FULL);

  //
  // Call the application's entry point.
  //
  main();
}

//*****************************************************************************
//
// This is the code that gets called when the processor receives a NMI.  This
// simply enters an infinite loop, preserving the system state for examination
// by a debugger.
//
//*****************************************************************************
static void NmiSR(void) {
  //
  // Enter an infinite loop.
  //
  while (1) {
  }
}

//*****************************************************************************
//
// This is the code that gets called when the processor receives a fault
// interrupt.  This simply enters an infinite loop, preserving the system state
// for examination by a debugger.
//
//*****************************************************************************
static void FaultISR(void) {
  //
  // Enter an infinite loop.
  //
  while (1) {
  }
}

//*****************************************************************************
//
// This is the code that gets called when the processor receives an unexpected
// interrupt.  This simply enters an infinite loop, preserving the system state
// for examination by a debugger.
//
//*****************************************************************************
static void IntDefaultHandler(void) {
  //
  // Go into an infinite loop.
  //
  while (1) {
  }
}
